import random

# Оголошуємо змінну для підрахунку кількості спроб
guessesTaken = 0
# Вивід привітання в консоль
print('Привіт! Як тебе звати?')
# Оголошуємо змінну для вводу імені
myName = input()
# Оголошуємо змінну для випадкового числа у вказаному діапазоні
number = random.randint(1, 100)
print('Давай зіграємо в гру '+myName+', я загадав число від 1 до 100')
# Створюємо цикл для перевірки кількості спроб вводу
while guessesTaken < 6:
    print('Як ти думаещ, яке?')
    guess = input()
    guess = int(guess)
#Вказуємо значення змінної для підрахунку кількості спроб
    guessesTaken = guessesTaken+1
# Якщо введене значення менше ніж загадане число - виводимо повідомлення в консоль
    if guess < number:
        print('Моє число більше твого')
# Якщо введене значення більше ніж загадане число - виводимо повідомлення в консоль
    if guess > number:
        print('Моє число менше твого')
# Якщо введене значення дорівнює числу - зупиняємо цикл
    if guess == number:
        break
# Якщо введене значення дорівнює загаданому числу - виводимо повідомлення про успіх з використаною кількістю спроб
if guess == number:
        guessesTaken = str(guessesTaken)
        print('Неперевершено  '+myName+ '! Ти вгадав число з '+guessesTaken+' спроби. Ти виграв!')
# Якщо введене значення не дорівнює загаданому числу - виводимо повідомлення про невдачу з використаною кількістю спроб
if guess != number:
        number = str(number)
        print('Нажаль в тебе не залишилось спроб. Я загадав число '+number+'. Ты проиграв. Але не журись! Наступного разу тобі пощастить!')


